barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountDetails.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gbo="urn:ucbru:gbo:v5" xmlns:acc="urn:ucbru:gbo:v5:acc">
    <soapenv:Body>
        <acc:AccountList>
            <acc:AccountDetails>
                <acc:AccountNo>01771357USDVTDC0BM</acc:AccountNo>
                <acc:Branch>A01</acc:Branch>
                <acc:CBAccountNo>42302840950010008527</acc:CBAccountNo>
                <acc:Ccy>USD</acc:Ccy>
                <acc:CcyDigital>840</acc:CcyDigital>
                <acc:Status>O</acc:Status>
                <acc:CustomerNo>01771357</acc:CustomerNo>
                <acc:Special>VTDC0</acc:Special>
                <acc:OpenDate>2017-03-27</acc:OpenDate>
                <acc:AltAccountNo>01771357USDVTDC0BM</acc:AltAccountNo>
                <acc:Type>S</acc:Type>
                <acc:ATMAvailable>N</acc:ATMAvailable>
                <acc:IsDormant>N</acc:IsDormant>
                <acc:PostAllowed>N</acc:PostAllowed>
                <acc:CreditTransAllowed>Y</acc:CreditTransAllowed>
                <acc:DebitTransAllowed>Y</acc:DebitTransAllowed>
                <acc:ClearingBank>044525545</acc:ClearingBank>
                <acc:CorBank>044525545</acc:CorBank>
                <acc:Positioning>
                    <acc:CBAccount>42302840950010008527</acc:CBAccount>
                    <acc:IMBAccountNo>42302840950010008527</acc:IMBAccountNo>
                    <acc:IMBBranch>A01</acc:IMBBranch>
                    <acc:HostABSAccountNo>01771357USDVTDC0BM</acc:HostABSAccountNo>
                    <acc:HostABSBranch>A01</acc:HostABSBranch>
                    <acc:HostABS>FCC</acc:HostABS>
                </acc:Positioning>
                <acc:MIS>
                    <acc:Pool>TR</acc:Pool>
                    <acc:GroupComponent>R_V_AP</acc:GroupComponent>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS1</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS2</acc:Name>
                        <acc:Value>RV1P</acc:Value>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS3</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS4</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS5</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS6</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS7</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS8</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS9</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS10</acc:Name>
                    </acc:TransactionClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS1</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS2</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS3</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS4</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS5</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS6</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS7</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS8</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS9</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS10</acc:Name>
                    </acc:CompositeClass>
                    <acc:CostCode>
                        <acc:Name>COSTCOD1</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD2</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD3</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD4</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD5</acc:Name>
                    </acc:CostCode>
                </acc:MIS>
                <acc:OpenBalance>0.00</acc:OpenBalance>
                <acc:CurrentBalance>418184.39</acc:CurrentBalance>
            </acc:AccountDetails>
        </acc:AccountList>
    </soapenv:Body>
</soapenv:Envelope>